Revit 2024 API
IDirectContext3DServer.RenderScene Method
 Performs rendering of the scene that the server creates.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
void RenderScene(
	View dBView,
	DisplayStyle displayStyle
)
Visual Basic
Sub RenderScene ( _
	dBView As View, _
	displayStyle As DisplayStyle _
)
Visual C++
void RenderScene(
	View^ dBView,
	DisplayStyle displayStyle
)
Parameters
dBView
Type: Autodesk.Revit.DB.View
 The view where rendering will occur.
displayStyle
Type: Autodesk.Revit.DB.DisplayStyle
 The display style of the view in which the submitted geometry will be drawn.
Remarks
The representation of geometry is in terms of a set of vertex and index buffers. The server can use facilities in Autodesk::Revit::DB::DirectContext3D::DrawContext to create the buffers and fill them with data that encode primitives such as triangles, lines, and points. The server can also adjust the geometry that it submits based on the argument to RenderScene() and in response to certain rendering parameters whose values are available through DrawContext (e.g., clip planes).
The final step in the process of submitting geometry for rendering is to call DrawContext::FlushBuffer() for the appropriate buffers.
This interface method may be called in a separate thread from the others.
See Also
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace